In [1]:
import sqlite3
import pandas as pd

In [2]:

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [3]:
# DDL: Create a table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    position TEXT NOT NULL,
    salary REAL NOT NULL,
    department TEXT
)
''')
conn.commit()

In [4]:
# DML: Insert data into the table
cursor.execute("INSERT INTO employees (name, position, salary, department) VALUES ('John Doe', 'Manager', 60000, 'Sales')")
cursor.execute("INSERT INTO employees (name, position, salary, department) VALUES ('Jane Smith', 'Developer', 80000, 'IT')")
cursor.execute("INSERT INTO employees (name, position, salary, department) VALUES ('Emily Johnson', 'Analyst', 70000, 'Finance')")
conn.commit()

In [5]:
# DML: Select data from the table
df = pd.read_sql_query("SELECT * FROM employees", conn)
print("Initial data in employees table:")
print(df)

Initial data in employees table:
   id           name   position   salary department
0   1       John Doe    Manager  60000.0      Sales
1   2     Jane Smith  Developer  80000.0         IT
2   3  Emily Johnson    Analyst  70000.0    Finance

In [6]:
# DDL: Alter the table to add a new column
cursor.execute("ALTER TABLE employees ADD COLUMN hire_date TEXT")
conn.commit()

In [7]:
cursor.execute("UPDATE employees SET salary = 65000 WHERE name = 'John Doe'")
conn.commit()

In [8]:
cursor.execute("DELETE FROM employees WHERE name = 'Emily Johnson'")
conn.commit()

In [9]:
# DML: Select data from the table after updates
df = pd.read_sql_query("SELECT * FROM employees", conn)
print("\nData in employees table after updates:")
print(df)

Data in employees table after updates:
   id        name   position   salary department hire_date
0   1    John Doe    Manager  65000.0      Sales      None
1   2  Jane Smith  Developer  80000.0         IT      None

In [10]:
# DDL: Drop the table
cursor.execute("DROP TABLE employees")
conn.commit()

In [11]:

# Verify the table has been dropped
try:
    df = pd.read_sql_query("SELECT * FROM employees", conn)
except Exception as e:
    print("\nThe employees table has been dropped.")
    print(f"Error: {e}")

The employees table has been dropped.
Error: Execution failed on sql 'SELECT * FROM employees': no such table: employees

In [12]:

# Close the connection
conn.close()